<?php
session_start(); // เริ่มต้นเซสชัน

// ตรวจสอบว่าผู้ใช้มีการล็อกอินหรือไม่
if (isset($_SESSION["User"])) {
    // ลบข้อมูลเซสชัน
    unset($_SESSION["User"]); // ลบตัวแปรเซสชันที่เก็บข้อมูลผู้ใช้
    session_destroy(); // ทำลายเซสชัน
    // แสดงข้อความออกจากระบบ
    echo "ออกจากระบบแล้ว<br>";
    echo '<a href="login.php">ลงชื่อเข้าใช้ใหม่</a>'; // ใช้เครื่องหมาย '' รอบลิงก์
    exit(); // หยุดการทำงานของสคริปต์
}

// เปลี่ยนเส้นทางไปยังหน้า Login
header("Location: login.php");
exit();
?>
